const replaceNumInTitle=[/ [၀၁၂၃၄၅၆၇၈၉]+ ?\-/g,'-$1-']; //出現在標題內的數字，前後加-，不被視為注釋號
export const parafix={ //注釋號可重覆（指向同一注釋），不可合併解釋
    '01_vinaya_01.html':{
        '222':['"ending">၁။','"footnote">၁။'],
        '458':['အခန်း</p>','အခန်း</h1>'],
        '498':['</h4p>','</h4>'],
    },
    '01_vinaya_02.html':{
        '191':['<p->','<p>'],
        '259':['<h2>၉-ပဏီတဘောဇနသိက္ခာပုဒ် အဖွင့်</p>','<h2>၉-ပဏီတဘောဇနသိက္ခာပုဒ် အဖွင့်</h2>'],
        '468':['<p->','<p>'],
        '507':['<h3>၃-ဝိကာလဂါမပ္ပဝိသနသိက္ခာပုဒ်</p>','<h3>၃-ဝိကာလဂါမပ္ပဝိသနသိက္ခာပုဒ်</h3>'],
        '614':['<h3>၉-နဝမသိက္ခာပုဒ်</h3','<h3>၉-နဝမသိက္ခာပုဒ်</h3>'],
        '655':['ဘိက္ခုနီဝိဘင်း</p>','ဘိက္ခုနီဝိဘင်း</h1>'],
        '732':['၁ရပါး','ရပါး'],
        '978':['</h4','</h4>']
    },
    '01_vinaya_03.html':{'192':['<.','</h2>'],'389':['<--p>','<p>']    },
    '01_vinaya_04.html':{'47':['<.','</h3>']},
    '01_vinaya_05.html':{'149':['<ph3>','<h3>'],'183':['<p->','<p>'],'235':['<p--->','<p>'],'275':['"footnote" >','"footnote">']},
    
    '02_digha_01.html':{
        '318':[[/^<\/p>$/,''],[/^<p class="unindent">$/,'']],
        '420':[[/^<\/p>$/,''],[/^<p class="unindent">$/,'']],
    },
    '02_digha_02.html':{//pn : array of fix
        '242':[], // ^1出現兩次，無可替代，為了隱憂warning
    },
    '02_digha_03.html':{ 
        '28':[['၂။','၁။'],['၄ဟု','၃ဟု']], //注釋 2與1同, 注釋 4 和3同
        '35':[['၁-၂','၁'],['၃-၄','၃']], //footnote 合併,  28 的 前兩個mark和後兩個mark 分別指向相同注釋,
        '51':[['၂၀','၂']],//緬文多打了一個0 အဝတ်ဖြူ၂၀
        '119':[['<p class="center">၁။','<p class="footnote">၁။']],
        '339':[['<p class="footnote">၁</span>။','<p class="footnote">၁။']],//干擾parse footnote
    },'03_majjhima_01.html':{
        '13': [['<p>၄။','<p class="footnote">၄။'],[/"footnote">(.)<\/span>။/g,'"footnote">$1။']],
        '36':['(၂- ၃- ၄)','(၂-၃-၄)'],
        '251':[['(၂- ၃)','(၂-၃)'],['(၄- ၅)','(၄-၅)'],['(၆- ၇)','(၆-၇)']],
        '287':['<p class=" center">','<p class="center">']
    },'03_majjhima_02.html':{
        '':['h1 class="center"','h1'],
        '271':['ဘ၀။','ဘဝ။'], //bha0 =>bhava
        '277':['<p class="">','<p>']
    },
    '03_majjhima_03.html':{
        '':['h1 class="center"','h1'],
        '53':['၆-ပ','-ပ'],//可能是錯字
        '297':['<p class="footnote">၁။','<p class="center">၁။']
    },
    '04_sanyutta_01.html':{
        '172':['ကို p class="footnote"သာ','ကို သာ '],
    },
    '04_sanyutta_02.html':{
        '10':[[/ဘ၀/g,'ဘဝ']],//0 和 va 混
        '38':[[/ဘ၀/g,'ဘဝ']],//0 和 va 混

    },
    '04_sanyutta_03.html':{
            //修改兩處，但不可拆開，因替換成功applyParaFix就break
        '62':['<h2>(၇) ၂-အရဟန္တဝဂ်<h2>','<h2>(၇)-၂-အရဟန္တဝဂ်</h2>'],
        '72':[' ၃-','-၃-'], 
        '92':[' ၅-','-၅-'],
        '81':[['<br>','']],
        '82':[' ၄-','-၄-'],
        '102':[' ၁-','-၁-'],
        '112':[' ၂-','-၂-'],
        '125':[' ၃-','-၃-'],
        '135':[' ၄-','-၄-'],
        '149':[' ၅-','-၅-'],
        '141':['</h3p>','</h3>'],
        '212':['<p ff>','<p>'],
        '213':['<p ff>','<p>'],
        '224':['<p><span class="paragraph">၂၂၄</span>-<span class="paragraph">၂၄၀</span>',
                '<p><span class="paragraph">၂၄၀</span>'],//224 repeated
        '333':[[/^-$/,'--']],
        '460-549':[['<h3></h3>','']], //line 1973, </br>已被去除
        '611':['၆၁၂/span>','၆၁၂</span>'],
    },
    '04_sanyutta_04.html':{
        '1':[['<p class=center>','<p class="center">']],
        '73':[' ၃-','-၃-'],
        '83':[' ၄-','-၄-'],
        '85':[['"center">၁။','"footnote">၁။'],
             ['"center">၂။','"footnote">၂။']
        ],
        '93':[' ၅-','-၅-'],
        '97':[['"center"->၁။','"footnote">၁။']],
        '123':[' ၃-','-၃-'],
        '133':[' ၄-','-၄-'],
        '145':[' ၅-','-၅-'],
        '227':[' ၃-','-၃-'],
        '237':[' ၄-','-၄-'],
        '206':[['<p class="center">၁။ ဤနေရာ၌','<p class="center">၁။ ဤနေရာ၌']],
        '232':[['<p class="center">၁။','<p class="footnote">၁။'],
            ['<p class="center">၂။ ကြိုးသည် = သံယောဇန','<p class="footnote">၂။ ကြိုးသည် = သံယောဇန</p>'],
            ["'သံယောဇဉ်'တည်း။</p>","<p>'သံယောဇဉ်'တည်း။</p>"],
        ],
        '244':[['<p class="center">၁။','<p class="footnote">၁။']],
        '352':[['<p class="unindent">',''],['ထိုစကားသည် မှန်၏၊ ငါ့ကို','<p class="unindent">ထိုစကားသည် မှန်၏၊ ငါ့ကို']],

    },
     '04_sanyutta_05.html':{
        '190':[['<-->နဝမသုတ်။</p>','<p class="center">နဝမသုတ်။</p>']],
        '215':[['<p33>','<p class="center">']],
        '257':[['လဝဂ်</p>','လဝဂ်</h2>']],
        '821':['၁သို့','သို့'], //非 note
        '922':[/၁၂ -/g,''], //誤判為注腳號
        '934':[/၁၀ -/g,''],
    },
    '05_anguttara_02.html':{
        '5':[[' style="text-align: center;" id="sigil_toc_id_8"','']],//殘餘
    },
    '05_anguttara_03.html':{
        '61':['(၇) ၂ ','(၇)-၂-'], //避免誤判為注腳號, 因為前後都無-，無法整批替換 
    },
    '05_anguttara_04.html':{
        '60':['(၇) ၂ -','(၇)၂-'], //避免誤判為注腳號
        '75':['<p>၁။ မြတ်သောရုပ်','<p class="footnote">၁။ မြတ်သောရုပ်']//footnote 不存在
    },
    '05_anguttara_06.html':{
        '44':[], //重覆 ^1
        '81':[['ယသုတ်</p>','ယသုတ်</h3>']]
    },
    '05_anguttara_10.html':{
        '193':[['<p class="footnote">၁','<p class="center">၁']]

    },
    '06_khuddaka_01.html':{
            '':[['<p></p>',''],['<p->','<p>']],
    },
    '06_khuddaka_02.html':{ 
        '230':['တ္ထု</p>','တ္ထု</h2>'],
        '228':[['</h2>','</p>']],
    },
    '06_khuddaka_08.html':{
        '179':['<--p>','<p>']
    },
    '06_khuddaka_10.html':{
        '20':['<h1 class="not_toc">','<h1>']
    },
    '06_khuddaka_11.html':{
        '':[['ခုဒ္ဒကနိကာယ် <p>','ခုဒ္ဒကနိကာယ် </p>'],['စရိယာပိဋကပါဠိတော် <p>','စရိယာပိဋကပါဠိတော် </p>'],
        ['မြန်မာပြန်<p>','မြန်မာပြန်</p>']
        ]
    },
    '06_khuddaka_13.html':{
        '2':['ကံအကြောင်းရင်းတည်း။</p>','ကံအကြောင်းရင်းတည်း။</h3>'],
        '16':[['ကြကုန်၏)။</p>','ကြကုန်၏)။</h3>'],['<h3 >','<h3>']],
        '7':[['ဖြတ် မဖြတ်ပြဿနာ<h3>','ဖြတ် မဖြတ်ပြဿနာ</h3>'],['<p >','<p>']],
        '10':['ပြဿနာ<h3>','ပြဿနာ</h3>'],
        '6':['မိန့်တော်မူ၏</h3>','မိန့်တော်မူ၏</p>'],
        '1':[[/^ $/,'']]
    },
    '07_abhidhamma_01.html':{
        '':['စေတသိက်ပိုင်း</p>','စေတသိက်ပိုင်း</h1>'],
        '58':['<p->','<p>'],
        '166':['<p><p>',''],
        '201':['<p class="center">ဒုတိယဈာန်စသည်များ</h5>','<p class="center">ဒုတိယဈာန်စသည်များ</p>'],
        '497':['ကြီးမြတ်သောအကျိုးရှစ်ပါး</h3>','ကြီးမြတ်သောအကျိုးရှစ်ပါး</p>'],
        '1155':['<h3>၆-ဩဃဂေါစ္ဆက/','<h3>၆-ဩဃဂေါစ္ဆက</h3>'],
        '1383':['ထုတ်ဆိုရာအပိုင်း</p>','ထုတ်ဆိုရာအပိုင်း</h1>']
    },
    '07_abhidhamma_02.html':{
        '19':[[/^-$/,'--']],  //strange cannot use ['-','--']
        '185':['၁၈၆။','<p>၁၈၆။'],
        '93':[/<p class="center ">/g,'<p class="center">'],
        '851':[[/^-$/,'--']],
        '215':[[/^-$/,'--'],['--</p>','--']],
        '221':[/ph3>/g,'h3>'],
        '33':[['<div class="list">','']
            ,['<span class="paragraph">၁</span>။ ပကိဏ္ဏကတိကနည်း ၁၃-ပါး','၁။ ပကိဏ္ဏကတိကနည်း ၁၃-ပါး']
            ,['<span class="paragraph">၂</span>။ ဝတ္ထုတိကနည်း ၂၅-ပါး','၂။ ဝတ္ထုတိကနည်း ၂၅-ပါး']
            ,['<span class="paragraph">၃</span>။ အာရမ္မဏတိကနည်း ၂၅-ပါး','၃။ အာရမ္မဏတိကနည်း ၂၅-ပါး']
            ,['<span class="paragraph">၄</span>။ အာယတနတိကနည်း ၁၀-ပါး','၄။ အာယတနတိကနည်း ၁၀-ပါး']
            ,['<span class="paragraph">၅</span>။ ဓာတုတိကနည်း ၁၀-ပါး','၅။ ဓာတုတိကနည်း ၁၀-ပါး']
            ,['<span class="paragraph">၆</span>။ ဣန္ဒြိယတိကနည်း ၈-ပါး','၆။ ဣန္ဒြိယတိကနည်း ၈-ပါး']
            ,['<span class="paragraph">၇</span>။ သုခုမတိကနည်း ၁၂-ပါး','၇။ သုခုမတိကနည်း ၁၂-ပါး']
            ,['</div>',''],['class="center "','class="center"']
        ],
        '4':[[/<h4 *class="center">/g,'<h4>'],['<h4 >','<h4>']],
        '48':['(ပြုပြင်စီရင်မှုအစု) ၁</p>','(ပြုပြင်စီရင်မှုအစု) ၁</h3>'] ,
        '150':['(ခန္ဓာငါးပါးတို့ကို ဒုက် ၁၀၀-တို့ဖြင့် ဝေဖန်၍ အဖြေဝိသဇ္ဇနာကို ပြခြင်း)</p>','(ခန္ဓာငါးပါးတို့ကို ဒုက် ၁၀၀-တို့ဖြင့် ဝေဖန်၍ အဖြေဝိသဇ္ဇနာကို ပြခြင်း)</h4>'],
        '385':['</\\h2>','</h2>'],'407':['<h3 class="center">','<h3>'],'622':['<h2 class="center">','<h2>']
    },
    '07_abhidhamma_05.html':{
        '':[['<h1 class="center">','<h1>'],['<h2 class="center">','<h2>']],
        '68':[/H2/g,'h2'],'297':['H3','h3'],
        '306':['တည်စေအပ်သည် မမည်။<p>','တည်စေအပ်သည် မမည်။</p>'],
        '548':['</့၂>','</h2>'],
        '278':[
            ['"center">၁။ သောတာပန်','"footnote">၁။ သောတာပန်'],
            ['"center">၂။ ဤသြဓိသောကထာ၌','"footnote">၂။ ဤသြဓိသောကထာ၌'],
            ['"center">၃။ (','"footnote">၃။ (']
        ],
        '630':[['၂<','၂-<'],['၃<','၃-<']],//不是注釋號

        '264':['<p><span class="paragraph">၇</span>။ မုဒိ','<p class="footnote">၇။ မုဒိ'],

        '346':['<p><span class="paragraph">၁၃</span>။ \'ဇရာမရဏံ',
            '<p class="footnote">၁၃။ \'ဇရာမရဏံ'],

    }
}

export const filefix={
    '01_vinaya_02.html':[[/ class="no_toc" ?>/g,'>']],
    '01_vinaya_03.html':[[/၉ရက်/g,'ရက်']],
    '01_vinaya_05.html':[[/ class="not_toc" ?>/g,'>']],
    '04_sanyutta_02.html':[ 
        ['<h3>၆-သဂါထာသုတ်</h3>\n<p><span class="paragraph">၁၀၁',
        '<h3>၆-သဂါထာသုတ်</h3>\n<p><span class="paragraph">၁၀၀']
    ], 
    '04_sanyutta_05.html':[  
        replaceNumInTitle, //出現在標題內的數字
        ['- ၁။','-</p><p>၁။'], //not a footnote
        [/<p>၁၀ဝ([၀၁၂၃၄၅၆၇၈၉])/g,'<p><span class="paragraph">၁၀၀$1</span>'], // 0誤為va ，漏標
    ],
    '05_anguttara_02.html':[replaceNumInTitle], 
    '05_anguttara_03.html':[replaceNumInTitle],
    '05_anguttara_04.html':[replaceNumInTitle],
    '05_anguttara_05.html':[replaceNumInTitle],
    // '06_khuddaka_02.html':[['</span>-<span class="paragraph">','-']],
    '06_khuddaka_10.html':[[/<p class="footnote_indent">၁။/g,'class="footnote">၁။'],
        [/ class="footnote_indent"> */g,'>'] //這是多行注釋
    ],
    '06_khuddaka_11.html':[[/ class="not_toc" ?/g,'']],
    '06_khuddaka_12.html':[[/<p class="footnote_indent">၁။/g,'class="footnote">၁။'],
    [/ class="footnote_indent"> */g,'>']],
    '06_khuddaka_13.html':[[/ class="not_toc" ?/g,''],[/<\/p-->/g,'</p>']],
    '07_abhidhamma_01.html':[[/ *class="not_toc" ?/g,''],[/ class="toc_7"/g,''],
        [/<p><\/p-->/g,''],[/<br>/g,''], [/\n<\/p>/g,'\n<p>'],[/၊<p\/>/g,'၊</p>']],

    '07_abhidhamma_02.html':[[/ class="not_toc" ?/g,''] ,[/<p>\n/g,'</p>\n'],[/<p><\/p>\n/g,'\n']],
    '07_abhidhamma_05.html':[[
        /<aside epub:type="footnote" id="[^>]+?"><p><span class="paragraph">/g,
        '<p><span class="footnote">'
    ],[/<\/p>\n<\/aside>/g,'</p>\n']
]
}

export const ignoreNote={ //此段內的數字不視為注釋號
     '04_sanyutta_01.html':{'258':true}, //sakyaname sutta, 1~7 的標號並不是注釋。
     '04_sanyutta_02.html':{'72':true} // ၁- 非注釋號

 }
export const ignoreReuse={ //隱藏footmark 重覆警告, 數字為原html行號, 0 起算( console 顯示的為CTRL+G 行號)
    '02_digha_02.html':[1749],
    '02_digha_03.html':[187,188],
}

